; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v6 ?v2)
             (pred_8 ?v13 ?v3)
             (pred_3 ?v6 ?v3)
             (pred_10 ?v10 ?v6 )
	     (pred_12 ?v6)
             (pred_2 ?v4)
             (pred_1 ?v13)
             (pred_5 ?v3)
             (pred_9 ?v6)
             (pred_11 ?v13)
             (pred_6 ?v6)
             (pred_4 ))



(:action op_4
:parameters (?v9 ?v12 ?v1 ?v7)
:precondition (and (pred_2 ?v9) (pred_2 ?v12) (pred_1 ?v1) (pred_5 ?v7)
          (pred_7 ?v9 ?v12) (pred_8 ?v1 ?v7)
                   (pred_3 ?v12 ?v7) (pred_12 ?v9) 
                   (pred_9 ?v12) (pred_11 ?v1))
:effect (and  (pred_6 ?v12) (not (pred_9 ?v12))))


(:action op_1
:parameters (?v9 ?v11)
:precondition (and (pred_2 ?v9) (pred_2 ?v11)
               (pred_12 ?v9) (pred_7 ?v9 ?v11) (pred_6 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v9))))

(:action op_2
:parameters (?v9 ?v1)
:precondition (and (pred_2 ?v9) (pred_1 ?v1) 
                  (pred_12 ?v9) (pred_10 ?v1 ?v9) (pred_4 ))
:effect (and (pred_11 ?v1)
   (not (pred_10 ?v1 ?v9)) (not (pred_4 ))))


(:action op_5
:parameters (?v9 ?v8 ?v5)
:precondition (and (pred_2 ?v9) (pred_1 ?v8) (pred_1 ?v5)
                  (pred_12 ?v9) (pred_11 ?v5) (pred_10 ?v8 ?v9))
:effect (and (pred_11 ?v8) (pred_10 ?v5 ?v9)
        (not (pred_11 ?v5)) (not (pred_10 ?v8 ?v9))))

(:action op_3
:parameters (?v9 ?v1)
:precondition (and (pred_2 ?v9) (pred_1 ?v1) 
                  (pred_12 ?v9) (pred_11 ?v1))
:effect (and (pred_4 ) (pred_10 ?v1 ?v9) (not (pred_11 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_19 obj_10 obj_24 obj_25 obj_07 obj_01 obj_04 obj_05 obj_11 obj_30 obj_14 obj_02 obj_27 obj_03 obj_06 obj_12 obj_23 obj_17 obj_15 obj_22 obj_21 obj_31 obj_32 obj_29
    obj_13 obj_18 obj_08
    obj_16 obj_20 obj_28 obj_09
    )

    (:init
       (pred_4)

       (pred_2 obj_26)
       (pred_2 obj_19)
       (pred_2 obj_10)
       (pred_2 obj_24)
       (pred_2 obj_25)
       (pred_2 obj_07)
       (pred_2 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_30)
       (pred_2 obj_14)
       (pred_2 obj_02)
       (pred_2 obj_27)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_23)
       (pred_2 obj_17)
       (pred_2 obj_15)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_2 obj_31)
       (pred_2 obj_32)
       (pred_2 obj_29)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_08)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_28)
       (pred_1 obj_09)

       (pred_7 obj_26 obj_07)
       (pred_7 obj_26 obj_19)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_10)
       (pred_7 obj_19 obj_26)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_10 obj_24)
       (pred_7 obj_10 obj_19)
       (pred_7 obj_24 obj_05)
       (pred_7 obj_24 obj_25)
       (pred_7 obj_24 obj_10)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_24)
       (pred_7 obj_07 obj_30)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_26)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_05 obj_27)
       (pred_7 obj_05 obj_11)
       (pred_7 obj_05 obj_24)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_11 obj_03)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_05)
       (pred_7 obj_30 obj_06)
       (pred_7 obj_30 obj_14)
       (pred_7 obj_30 obj_07)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_14 obj_02)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_14 obj_30)
       (pred_7 obj_02 obj_23)
       (pred_7 obj_02 obj_27)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_14)
       (pred_7 obj_27 obj_17)
       (pred_7 obj_27 obj_03)
       (pred_7 obj_27 obj_05)
       (pred_7 obj_27 obj_02)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_03 obj_27)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_30)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_12 obj_23)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_23 obj_31)
       (pred_7 obj_23 obj_17)
       (pred_7 obj_23 obj_02)
       (pred_7 obj_23 obj_12)
       (pred_7 obj_17 obj_32)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_27)
       (pred_7 obj_17 obj_23)
       (pred_7 obj_15 obj_29)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_22 obj_21)
       (pred_7 obj_22 obj_06)
       (pred_7 obj_21 obj_31)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_21 obj_22)
       (pred_7 obj_31 obj_32)
       (pred_7 obj_31 obj_23)
       (pred_7 obj_31 obj_21)
       (pred_7 obj_32 obj_29)
       (pred_7 obj_32 obj_17)
       (pred_7 obj_32 obj_31)
       (pred_7 obj_29 obj_15)
       (pred_7 obj_29 obj_32)
       (pred_9 obj_07)
       (pred_9 obj_05)
       (pred_9 obj_29)
       (pred_9 obj_11)
       (pred_3  obj_07 obj_13)
       (pred_3  obj_05 obj_18)
       (pred_3  obj_29 obj_08)
       (pred_3  obj_11 obj_18)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_10)
       (pred_6 obj_24)
       (pred_6 obj_25)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_30)
       (pred_6 obj_14)
       (pred_6 obj_02)
       (pred_6 obj_27)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_23)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_22)
       (pred_6 obj_21)
       (pred_6 obj_31)
       (pred_6 obj_32)

       (pred_8  obj_16 obj_13)
       (pred_8  obj_20 obj_18)
       (pred_8  obj_28 obj_08)
       (pred_8  obj_09 obj_08)
       (pred_10 obj_16 obj_32)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_28 obj_21)
       (pred_10 obj_09 obj_21)
       (pred_12 obj_27)
    )

    (:goal (and
       (pred_10 obj_20 obj_15)
    ))
(:constraints
  (always (not (pred_12 obj_17)))
)
)

; plan
1. (op_1 obj_27 obj_02)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_02)
   goals met: 0 of 1
2. (op_1 obj_02 obj_04)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_04)
   goals met: 0 of 1
3. (op_1 obj_04 obj_10)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_19)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_19)
   goals met: 0 of 1
5. (op_2 obj_19 obj_20)
   deleted: (pred_10 obj_20 obj_19) (pred_4)
   added: (pred_11 obj_20)
   goals met: 0 of 1
6. (op_1 obj_19 obj_10)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_10)
   goals met: 0 of 1
7. (op_1 obj_10 obj_04)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_04)
   goals met: 0 of 1
8. (op_1 obj_04 obj_02)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_02)
   goals met: 0 of 1
9. (op_1 obj_02 obj_27)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_27)
   goals met: 0 of 1
10. (op_1 obj_27 obj_03)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_03)
   goals met: 0 of 1
11. (op_1 obj_03 obj_15)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_15)
   goals met: 0 of 1
12. (op_3 obj_15 obj_20)
   deleted: (pred_11 obj_20)
   added: (pred_4) (pred_10 obj_20 obj_15)
   goals met: 1 of 1
